##<a name="legal-notices"></a>Юридические уведомления
Корпорация Майкрософт и другие участники предоставляют вам лицензию на документацию корпорации Майкрософт и другое содержимое данного репозитория в соответствии с положениями [лицензии Creative Commons Attribution 4.0 International Public License](https://creativecommons.org/licenses/by/4.0/legalcode) (см. файл [LICENSE](LICENSE)) и лицензию на любой код, находящийся в этом репозитории, в соответствии с положениями [лицензии MIT](https://opensource.org/licenses/MIT) (см. файл [LICENSE-CODE](LICENSE-CODE)).

Microsoft, Windows, Microsoft Azure и/или другие продукты и службы Майкрософт, указанные в данной документации, могут являться товарными знаками или зарегистрированными товарными знаками корпорации Майкрософт в Соединенных Штатах и/или других странах.
Лицензии этого проекта не дают вам право использовать какие бы то ни было имена, логотипы и товарные знаки корпорации Майкрософт.
Общее руководство по использованию товарных знаков корпорации Майкрософт можно найти на странице http://go.microsoft.com/fwlink/?LinkID=254653.

Информацию о соблюдении конфиденциальности можно найти на странице https://privacy.microsoft.com/ru-ru/

Корпорация Майкрософт и другие участники оставляют за собой все остальные права, принадлежащие им как на основании соответствующих авторских прав, патентов или товарных знаков, так и подразумеваемые, принадлежащие в силу правовой презумпции или иным способом.